package Lab01;

/**
 * Выведите строки в следующем порядке:
 * Я
 * хорошо
 * знаю
 * Java.
 */
public class Task1 {

  // todo simplify
  public static void main(String[] args) {
    System.out.println("Я");
    System.out.println("хорошо");
    System.out.println("знаю");
    System.out.println("Java");
  }
}
